---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalSurface
source: html/cab888a7-1d59-127d-1afa-b0fcac026368.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalSurface Property

"Analytical Surface"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalSurface { get; }
```